In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [32]:
x = [34,56,78,44,56,12,89,None,None]
y = ['Sachin','Rohit','Virat','Dhoni','Yuvraj','Sehwag','Bhuvi','Umesh','Ishant']

In [33]:
len(x)

9

In [34]:
len(y)

9

In [35]:
data = {
    'score' : x,
    'name' : y
}

In [36]:
s = pd.Series(data)

In [37]:
s

name     [Sachin, Rohit, Virat, Dhoni, Yuvraj, Sehwag, ...
score             [34, 56, 78, 44, 56, 12, 89, None, None]
dtype: object

In [38]:
s = pd.Series(y)

In [39]:
s

0    Sachin
1     Rohit
2     Virat
3     Dhoni
4    Yuvraj
5    Sehwag
6     Bhuvi
7     Umesh
8    Ishant
dtype: object

In [40]:
s = pd.Series(y, index=x)

In [41]:
s

34     Sachin
56      Rohit
78      Virat
44      Dhoni
56     Yuvraj
12     Sehwag
89      Bhuvi
NaN     Umesh
NaN    Ishant
dtype: object

In [42]:
s[0:4]

34    Sachin
56     Rohit
78     Virat
44     Dhoni
dtype: object

In [43]:
df = pd.DataFrame(data)

In [44]:
df

     name  score
0  Sachin   34.0
1   Rohit   56.0
2   Virat   78.0
3   Dhoni   44.0
4  Yuvraj   56.0
5  Sehwag   12.0
6   Bhuvi   89.0
7   Umesh    NaN
8  Ishant    NaN

In [45]:
df.columns

Index(['name', 'score'], dtype='object')

In [46]:
df['name']

0    Sachin
1     Rohit
2     Virat
3     Dhoni
4    Yuvraj
5    Sehwag
6     Bhuvi
7     Umesh
8    Ishant
Name: name, dtype: object

In [48]:
df.isnull()

    name  score
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False   True
8  False   True

In [51]:
df_2 = df[df['score'] > 50]

In [52]:
df_2

     name  score
1   Rohit   56.0
2   Virat   78.0
4  Yuvraj   56.0
6   Bhuvi   89.0

In [54]:
df.dropna()

     name  score
0  Sachin   34.0
1   Rohit   56.0
2   Virat   78.0
3   Dhoni   44.0
4  Yuvraj   56.0
5  Sehwag   12.0
6   Bhuvi   89.0

In [56]:
#df.dropna(inplace=True)
df.fillna(0)

     name  score
0  Sachin   34.0
1   Rohit   56.0
2   Virat   78.0
3   Dhoni   44.0
4  Yuvraj   56.0
5  Sehwag   12.0
6   Bhuvi   89.0
7   Umesh    0.0
8  Ishant    0.0